backend/views/shop-products/index.php

                'label' => 'Gallery',
                'attribute' => 'image',
                'value' => function($value) {
                    $gallery_model = \common\models\ShopProductsGalleries::find()->where(['product_id' => $value->id])->all();
---
SELECT * FROM `shop_products_galleries` WHERE `product_id`=25

                'label' => 'Category',
                'attribute' => 'category_id',
                'value' => function($value) {
                    $model = \common\models\ShopCategories::findOne(['id' => $value->category_id]);
---
SELECT * FROM `shop_categories` WHERE `id`=1