backend/views/shop-products/view.php

                'label' => 'Gallery',
                'attribute' => 'image',
                'value' => function($value) {
                    $gallery_model = \common\models\ShopProductsGalleries::find()->where(['product_id' => $value->id])->all();
---
SELECT * FROM `shop_products_galleries` WHERE `product_id`=25