backend/controllers/ShopCategoriesController.php

INSERT INTO `shop_categories` (`category_name`, `img`) VALUES ('faaaa', '1598527347canvas33333.jpg')
---
    public function actionCreate()
    {
        $model = new ShopCategories();

        if ($model->load(Yii::$app->request->post())) {
            $img = UploadedFile::getInstance($model, 'img');

            $time = time();
            $model->img = $time . $img->baseName . '.' . $img->extension;

            if ($model->save(false)) {

SELECT * FROM `shop_categories` WHERE `id`='1'
DELETE FROM `shop_categories` WHERE `id`=1
---
    public function actionDelete($id)
    {
        $model = ShopCategories::findOne(['id' => $id]);

        try {
            unlink(Yii::$app->Url->unlinkUrl() . $model->img);
            $model->delete();

SELECT * FROM `shop_categories` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = ShopCategories::findOne($id)) !== null) {