backend/controllers/ShopProductsController.php

INSERT INTO `shop_products_galleries` (`img`, `product_id`) VALUES ('1598657073canvas33333.jpg', 26)
---
    public function actionCreate()
    {
        $model = [];
        $model[] = new ShopProducts();
        $model[] = new ShopProductsGalleries();

        $post_request = Yii::$app->request->post();

        if ($post_request) {
            $model[0]->setAttributes($post_request['ShopProducts']);
            $images = UploadedFile::getInstances($model[1], 'img');
            $control = true;

            if ($model[0]->save()) {
                foreach($images as $img) {
                    echo $img;
                    $time = time();
                    $gallery = new ShopProductsGalleries;
                    $gallery->img = $time . $img->baseName . '.' . $img->extension;
                    $gallery->product_id = $model[0]->id;
                    if ($gallery->upload($img, $time)) {
                        if ($gallery->save(false)) {

SELECT * FROM `shop_products` WHERE `id`='25'
---
    protected function findModel($id)
    {
        if (($model = ShopProducts::findOne($id)) !== null) {