frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $this->layout = 'home-layout';

        $categories = \common\models\ShopCategories::find()->all();
        $categories_count = count($categories);
        $products = \common\models\ShopProducts::find()->all();
---
SELECT * FROM `shop_categories`
SELECT * FROM `shop_products`

    public function actionShop($category = '', $sorting = '')
    {
        $categories = \common\models\ShopCategories::find()->all();

        if ($category === '') {
            $products = \common\models\ShopProducts::find()->all();
        } else {
            $products = \common\models\ShopProducts::find()->where(['category_id' => (int) $category])->all();
---
SELECT * FROM `shop_categories`
SELECT * FROM `shop_products`
SELECT * FROM `shop_products` WHERE `category_id`=6