frontend/views/site/index.php

SELECT * FROM `shop_products_galleries` WHERE `product_id`=25
---
                            <div class="single-product mt-50">
                                <div class="product-image">
                                    <div class="image">
                                    <?= Html::img(
                                        Yii::$app->Url->imgUrl() . \common\models\ShopProductsGalleries::findOne(['product_id' => $product->id])->img,
                                        ['class' => 'product-1']
                                    ) ?>

SELECT * FROM `shop_products` WHERE `category_id`=5 LIMIT 12
---
                <div class="tab-pane fade" id="tab<?= $i ?>">
                    <div class="row">
                        <?php
                            $tmp_model = \common\models\ShopProducts::find()->where(['category_id' => $category->id])->limit(12)->all();

SELECT * FROM `shop_products_galleries` WHERE `product_id`=25
---
                                <div class="single-product mt-50">
                                    <div class="product-image">
                                        <div class="image">
                                            <?= Html::img(
                                                Yii::$app->Url->imgUrl() . \common\models\ShopProductsGalleries::findOne(['product_id' => $product->id])->img,
                                                ['class' => 'product-1']
                                            ) ?>