frontend/views/site/shop.php

                    <div class="row">
                        <?php
                            foreach ($products as $product):
                                $img = \common\models\ShopProductsGalleries::findOne(['product_id' => $product->id]);
---
SELECT * FROM `shop_products_galleries` WHERE `product_id`=25